# One Hot Encoding

# now we will handle the categorical features to convert into meaningful data like into numerical data

In [31]:
import pandas as pd
import numpy as np

In [32]:
df= pd.read_csv("titanic.csv", usecols=['Sex'])

In [33]:
df

        Sex
0      male
1    female
2    female
3    female
4      male
..      ...
886    male
887  female
888  female
889    male
890    male

[891 rows x 1 columns]

In [34]:
df.isnull().sum()

Sex    0
dtype: int64

In [35]:
pd.get_dummies(df, drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [36]:
# take another column Embarked
df= pd.read_csv("titanic.csv", usecols=['Embarked'])

In [37]:
df.value_counts()

Embarked
S           644
C           168
Q            77
dtype: int64

In [38]:
df.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [39]:
df[df.Embarked.isnull()]

    Embarked
61       NaN
829      NaN

In [40]:
# handle NaN value through most frequent value

df.Embarked.fillna("S", inplace=True)

In [41]:
df.Embarked.isnull().sum()

0

In [42]:
# Not get dummies :  One hot encoding

pd.get_dummies(df, drop_first=True)

     Embarked_Q  Embarked_S
0             0           1
1             0           0
2             0           1
3             0           1
4             0           1
..          ...         ...
886           0           1
887           0           1
888           0           1
889           0           0
890           1           0

[891 rows x 2 columns]